using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace QuestEditor
{
	class Program
	{
		//Перед вами стоит задача написать кусочек редактора квестов для RPG игры. Редактор представляет собой набор готовых блоков с 
		//основными условиями и их результатами, которые может комбинировать между собой пользователь.

		//Вы отвечаете за разработку бизнес-слоя, содержащего "блоки" квеста и их логику. Выберите подходящий паттерн(ы), 
		//которые вы будете использовать для реализации данной задачи.

		//Обоснуйте свой выбор. Напишите простейший пример (без UI) для одного из блоков.

		//Пример квеста в редакторе:

		//герой повстречал персонажа -> вызвать диалог -> вывести текст -> ... -> при выборе первого пункта добавить квест на выполение в таблицу квестов.

		//Предложенное решение должно быть легко расширяемым для быстрого добавления новых элементов в редактор.
		static void Main(string[] args)
		{
		}
	}
}
